welonhan/STM32F407_RC_EMWIN_EX_SDRAM/Projects/Src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Hanwl
  * @version V1.0
  * @date    2016-12-19
  * @brief   Main program body
  ******************************************************************************
**/

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4_discovery_lcd.h"
#include "stm32f4_discovery_uart.h"
#include "stm32f4_discovery_touch.h"
#include "stm32f4_discovery_sd.h"
#include "drv_RF24l01.h"
#include "drv_adc.h"
#include "stm324xg_eval_sram.h"

/* FatFs includes component */
#include "ff_gen_drv.h"
#include "sd_diskio.h"
#include <stdio.h>


/*GUI includes component */
#include "GUI.h"
#include "GUIApp.h"
#include "DIALOG.h"

/* TOUCH ---------------------------------------------------------------------*/
I2C_HandleTypeDef I2cHandle;
TOUCH_XY_Typedef TOUCH_Dat;

/* UART ----------------------------------------------------------------------*/
UART_HandleTypeDef UartHandle;
__IO ITStatus UartReady = RESET;

/* SD card -------------------------------------------------------------------*/
SD_HandleTypeDef uSdHandle;
SD_CardInfo uSdCardInfo;

/* LCD backlight PWM ---------------------------------------------------------*/
TIM_HandleTypeDef    TimHandle;
TIM_OC_InitTypeDef sConfig;

/* ADC -----------------------------------------------------------------------*/
ADC_HandleTypeDef  AdcHandle;
uint32_t ADC_Bat_Num=0, ADC_Tmp_Num=0;
uint8_t ADC_Count=0;

/* SRAM ------------------------------------------------------------*/
#define BUFFER_SIZE         ((uint32_t)0x0100)
#define WRITE_READ_ADDR     ((uint32_t)0x0800)
uint16_t aTxBuffer[BUFFER_SIZE];
uint16_t aRxBuffer[BUFFER_SIZE];

/* FATFS ---------------------------------------------------------------------*/
FATFS SDFatFs;  /* File system object for SD card logical drive */
FIL MyFile;     /* File object */
char SDPath[4]; /* SD card logical drive path */
uint8_t duty=0;

uint8_t GUI_Initialized   = 0;

GUI_PID_STATE Touch_State;

/* NRF24L01 ------------------------------------------------------------------*/
#ifdef DEBUG_MODE

char		NRF24L01_TX_DATA[32]="aaaaaaaaaaaaaaaaaaaazzzzzzzzzzb";
uint8_t NRF24L01_ACK_DATA[32]={0};
uint8_t NRF24L01_ACK[8]={88,00,99,99,00,00,66,55};
uint8_t NRF24L01_TX_NUM=sizeof(NRF24L01_TX_DATA);
uint8_t NRF24L01_ACK_NUM=sizeof(NRF24L01_ACK_DATA);
uint16_t ADC_DATA_Debug[4]={0,0,0,0};
uint32_t *DMA_ADC_MEM_ADDR =(uint32_t *)&ADC_DATA_Debug[0];
RC_DATA_TypeDef RC_DATA;

#else
RC_DATA_TypeDef RC_DATA;
uint8_t 	NRF24L01_TX_NUM=sizeof(RC_DATA.RC_TX_Data);
uint8_t 	NRF24L01_ACK_NUM=sizeof(RC_DATA.RC_ACK_Data);
uint32_t 	*DMA_ADC_MEM_ADDR=(uint32_t *)&RC_DATA.ADC_DATA;

#endif

/* Private function prototypes -----------------------------------------------*/
static void SystemClock_Config(void);
static void Error_Handler(void);

void 				FATFS_Test(void);
static void Fill_Buffer(uint16_t *pBuffer, uint32_t uwBufferLenght, uint16_t uwOffset);
uint8_t 		Buffercmp(uint16_t* pBuffer1, uint16_t* pBuffer2, uint16_t BufferLength);	
void 				SRAM_Test(void);
void 				TXT_2_NUM(uint8_t* txt);
uint32_t 		NUM_2_TXT(uint8_t* txt);
void 				READ_CONFIG_File(void);
void 				WRITE_CONFIG_File(void);

Typdef_ModelData _ModelData[4][4]=
{
	//Model1
	{
		{11,	0, 	100, 100,0},
		{12,	0, 	100, 100,0},
		{13,	0, 	100, 100,0},
		{14,	0, 	100, 100,0},
	},

	//Model2
	{
		{21,	0, 	100, 100,0},
		{22,	0, 	100, 100,0},
		{23,	0, 	100, 100,0},
		{24,	0, 	100, 100,0},
	},

	//Model3
	{
		{31,	0, 	100, 100,0},
		{32,	0, 	100, 100,0},
		{33,	0, 	100, 100,0},
		{34,	0, 	100, 100,0},
	},

	//Model4
	{
		{41,	0, 	100, 100,0},
		{42,	0, 	100, 100,0},
		{43,	0, 	100, 100,0},
		{44,	0, 	100, 100,0},
	},
};
uint8_t ADC_REF=50;
uint8_t BACKLIGHT=100;
uint8_t tmp_backlight, tmp_adc_ref;
Typdef_ModelData tmp_modeldata[4];

uint8_t CH3_Switch=0;
uint8_t CH4_Switch=0;
uint8_t MODEL=0;
uint8_t BACKLIGHT_ON=1;
uint32_t DASH_BOARD[4]=
{
	180,180,180,180
};

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
		/* STM32F4xx HAL library initialization:
       - Configure the Flash prefetch, instruction and Data caches
       - Configure the Systick to generate an interrupt each 1 msec
       - Set NVIC Group Priority to 4
       - Global MSP (MCU Support Package) initialization
     */
	uint32_t i,temp1=0,temp2=0;
	//uint32_t x,y,pixel,pixel1;
	RC_DATA.TX_CHANL=60;
	
  HAL_Init();
	
	//0 bits for preemption priority
  //4 bits for subpriority
	HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_0);
  
  /* Configure the system clock to 168 MHz */
  SystemClock_Config();
  
  /* Configure LED1 and LED3 */
  BSP_LED_Init(LEDR);
  BSP_LED_Init(LEDG);
	
	BSP_PB_Init(BUTTON_KEY,BUTTON_MODE_EXTI);
	
	BSP_UART2_Init();	
	printf("UART2 init ok!\n\r");
	
	BSP_LCD_BACKLIGHT_PWM_Init();
	
	BSP_LCD_Init();
	printf("LCD init ok!\n\r");
	
	BSP_SRAM_Init();
	
	BSP_TOUCH_Init();
	
	BSP_ADC_Init();
	
	for(i=0;i<10;i++)
	{
		temp1+=RC_DATA.ADC_DATA.ADC_STR;
		temp2+=RC_DATA.ADC_DATA.ADC_THRT;
		HAL_Delay(20);
	}
	RC_DATA.ADC_StrMid=(uint16_t)(temp1/10);
	RC_DATA.ADC_ThrtMid=(uint16_t)(temp2/10);

	//NRF24L01_check();
	
	NRF24L01_Init();	
/*	
	pixel=1;
	while(1)
	{
		BSP_LCD_FillRec(0,0,800-1,480-1,pixel);
		HAL_Delay(1);
		pixel++;
		if(pixel>0xffff)
			pixel=0;
	}

	BSP_LCD_FillRec(0,0,5,5,0x1f);
	
	while(1){
	for(pixel=0;pixel<65536;pixel+=200)
	{
		for(y=0;y<480;y+=240)
		{
			pixel1=pixel;
			for(x=0; x<=800;x+=50)
			{
				BSP_LCD_FillRec(x,y,x+50,y+240,pixel1);
				pixel1+=50;
			}
		}
		HAL_Delay(10000);
	}
	}
*/
	
	//FATFS_Test();
	//SRAM_Test();
	READ_CONFIG_File();
	BSP_LCD_BACKLIGHT_PWM_Set(BACKLIGHT);
	//STemWin need enable CRC
	__HAL_RCC_CRC_CLK_ENABLE();
	
	/* Activate the use of memory device feature */
  //WM_SetCreateFlags(WM_CF_MEMDEV);
  
  /* Init the STemWin GUI Library */
  GUI_Init();
  
  GUI_Initialized = 1;

  /* Start Demo */
  MainTask();
	
/*	
	while(1)
	{
		//定时发送遥控数据，延时可根据需要修改
		HAL_Delay(20);
		RC_TX_DataHandle(&RC_DATA);
		NRF24L01_TxPacket( (uint8_t *)&RC_DATA.RC_TX_Data	, NRF24L01_TX_NUM );
		
