welonhan/STM32F407_RC_EMWIN_EX_SDRAM/Projects/Src/main.c
	}
*/	
}

/**
  * @brief  FATFS SD card test
  * @param  None
  * @retval None
  */
void FATFS_Test(void)
{
	FRESULT res;                                          /* FatFs function common result code */
  uint32_t byteswritten, bytesread;                     /* File write/read counts */
  //uint8_t wtext[] = "This is STM32 working with FatFs"; /* File write buffer */
  uint8_t wtext[] = "1,0,100,100,0;2,0,100,100,0;3,0,100,100,0;4,0,100,100,0;5,100;";
	uint8_t rtext[100];                                   /* File read buffer */
  /*##-1- Link the micro SD disk I/O driver ##################################*/
  if(FATFS_LinkDriver(&SD_Driver, SDPath) == 0)
  {
    /*##-2- Register the file system object to the FatFs module ##############*/
    if(f_mount(&SDFatFs, (TCHAR const*)SDPath, 0) != FR_OK)
    {
      /* FatFs Initialization Error */
      Error_Handler();
    }
    else
    {
      /*##-3- Create a FAT file system (format) on the logical drive #########*/
      /* WARNING: Formatting the uSD card will delete all content on the device */
      if(f_mkfs((TCHAR const*)SDPath, 0, 0) != FR_OK)
      {
        /* FatFs Format Error */
        Error_Handler();
      }
      else
      {
        /*##-4- Create and Open a new text file object with write access #####*/
        if(f_open(&MyFile, "STM32.TXT", FA_CREATE_ALWAYS | FA_WRITE) != FR_OK)
        {
          /* 'STM32.TXT' file Open for write Error */
          Error_Handler();
        }
        else
        {
          /*##-5- Write data to the text file ################################*/
          res = f_write(&MyFile, wtext, sizeof(wtext), (void *)&byteswritten);
          
          if((byteswritten == 0) || (res != FR_OK))
          {
            /* 'STM32.TXT' file Write or EOF Error */
            Error_Handler();
          }
          else
          {
            /*##-6- Close the open text file #################################*/
            f_close(&MyFile);
            
            /*##-7- Open the text file object with read access ###############*/
            if(f_open(&MyFile, "STM32.TXT", FA_READ) != FR_OK)
            {
              /* 'STM32.TXT' file Open for read Error */
              Error_Handler();
            }
            else
            {
              /*##-8- Read data from the text file ###########################*/
              res = f_read(&MyFile, rtext, sizeof(rtext), (UINT*)&bytesread);
              
              if((bytesread == 0) || (res != FR_OK))
              {
                /* 'STM32.TXT' file Read or EOF Error */
                Error_Handler();
              }
              else
              {
                /*##-9- Close the open text file #############################*/
                f_close(&MyFile);
                
                /*##-10- Compare read data with the expected data ############*/
                if((bytesread != byteswritten))
                {                
                  /* Read data is different from the expected data */
                  Error_Handler();
                }
                else
                {
                  /* Success of the demo: no error occurrence */
                  BSP_LED_On(LEDG);
                }
              }
            }
          }
        }
      }
    }
  }
  
  /*##-11- Unlink the micro SD disk I/O driver ###############################*/
  FATFS_UnLinkDriver(SDPath);	
	
}

/**
  * @brief  Read config data file from SD Card
  * @param  None
  * @retval None
  */
void READ_CONFIG_File(void)
{
	FRESULT res;                                          /* FatFs function common result code */
  uint32_t byteswritten, bytesread;                     /* File write/read counts */
  uint8_t wtext[] = "11,50,60,60,0;12,60,70,70,1;13,70,80,80,0;14,80,90,100,0;\
											21,50,60,60,0;22,60,70,70,1;23,70,80,80,0;24,80,90,100,0;\
												31,50,60,60,0;32,60,70,70,1;33,70,80,80,0;34,80,90,100,0;\
													41,50,60,60,0;42,60,70,70,1;43,70,80,80,0;44,80,90,100,0;\
														51,70;\
															61,2;\
																71,50;"; /* File write buffer */
  uint8_t rtext[500];                                   /* File read buffer */
	//uint8_t text[500];
  /*##-1- Link the micro SD disk I/O driver ##################################*/
  if(FATFS_LinkDriver(&SD_Driver, SDPath) == 0)
  {
    /*##-2- Register the file system object to the FatFs module ##############*/
    if(f_mount(&SDFatFs, (TCHAR const*)SDPath, 0) != FR_OK)
    {
      /* FatFs Initialization Error */
      Error_Handler();
    }
    else
    {
      if(f_open(&MyFile, "RC.TXT", FA_OPEN_ALWAYS | FA_WRITE|FA_READ) != FR_OK)
      {
          /* 'STM32.TXT' file Open for write Error */
          Error_Handler();
      }
      else
      {
          /*##-5- Write data to the text file ################################*/
          res = f_read(&MyFile, rtext, sizeof(rtext), (UINT*)&bytesread);
          if(res != FR_OK)
          {
            /* 'STM32.TXT' file read or EOF Error */
            Error_Handler();
          }
					else if(bytesread == 0)
          {
            /* 'STM32.TXT' file empty, write default data to file */
            /*##-5- Write data to the text file ################################*/
						res = f_write(&MyFile, wtext, sizeof(wtext), (void *)&byteswritten);
						if((byteswritten == 0) || (res != FR_OK))
						{
							/* 'STM32.TXT' file Write or EOF Error */
							Error_Handler();
						}
						else
							f_close(&MyFile);
						TXT_2_NUM(wtext);
					}
					
          else
					{
						TXT_2_NUM(rtext);
						/*##-6- Close the open text file #################################*/
						f_close(&MyFile);
					}            
      }
    }
  }
  
  /*##-11- Unlink the micro SD disk I/O driver ###############################*/
  FATFS_UnLinkDriver(SDPath);		
	
	//NUM_2_TXT(text);
	
}

/**
  * @brief  Read config data file from SD Card
  * @param  None
  * @retval None
  */
void WRITE_CONFIG_File(void)
{
	FRESULT res;                                          /* FatFs function common result code */
  uint32_t byteswritten, bytes;                     /* File write/read counts */
  uint8_t wtext[500]; 																	/* File write buffer */
  //uint8_t rtext[100];                                   /* File read buffer */
  /*##-1- Link the micro SD disk I/O driver ##################################*/
  if(FATFS_LinkDriver(&SD_Driver, SDPath) == 0)
  {
    /*##-2- Register the file system object to the FatFs module ##############*/
    if(f_mount(&SDFatFs, (TCHAR const*)SDPath, 0) != FR_OK)
    {
      /* FatFs Initialization Error */
      Error_Handler();
    }
    else
    {
      if(f_unlink ("RC.TXT") != FR_OK)
      {
          /* 'STM32.TXT' file Open for write Error */
          Error_Handler();
      }
      else
      {
        if(f_open(&MyFile, "RC.TXT", FA_OPEN_ALWAYS | FA_WRITE|FA_READ) != FR_OK)
				{
          /* 'STM32.TXT' file Open for write Error */
          Error_Handler();
				}
				else
				{
          //writ to the file
					bytes=NUM_2_TXT(wtext);
					res = f_write(&MyFile, wtext, bytes, (void *)&byteswritten);
					if((byteswritten == 0) || (res != FR_OK))
					{
						/* 'STM32.TXT' file Write or EOF Error */
						Error_Handler();
					}
					else
						f_close(&MyFile);						
        }
			}
		}
  }
  /*##-11- Unlink the micro SD disk I/O driver ###############################*/
  FATFS_UnLinkDriver(SDPath);		
}

/**
  * @brief  Read config data file from SD Card
  * @param  None
  * @retval None
  */
uint32_t NUM_2_TXT(uint8_t* txt)
{
	uint32_t i=0,j=0,ch=0,model;
	uint8_t tmp[3];
	uint32_t num;
	uint32_t data[5];	
	for(model=0;model<4;model++)
	{
		for(ch=0;ch<4;ch++)
		{ 
			data[0]=(uint32_t)(_ModelData[model][ch].Model);
			data[1]=(uint32_t)(_ModelData[model][ch].SubTrim+50);
			data[2]=(uint32_t)_ModelData[model][ch].Endpoint_p;
			data[3]=(uint32_t)_ModelData[model][ch].Endpoint_n;
			data[4]=(uint32_t)_ModelData[model][ch].Reverse;	
			for(j=0;j<5;j++)
			{
				tmp[0]=data[j]/100;
				num=data[j]%100;
				tmp[1]=num/10;
				tmp[2]=num%10;
				if(tmp[0]!=0)
				{
					*(txt+i)=tmp[0]+48;
					i++;
					*(txt+i)=tmp[1]+48;
					i++;
					*(txt+i)=tmp[2]+48;
					i++;
				}
				else if(tmp[1]!=0)
				{
					*(txt+i)=tmp[1]+48;
					i++;
					*(txt+i)=tmp[2]+48;
					i++;
				}		
				else
				{
					*(txt+i)=tmp[2]+48;
					i++;
				}
				if(j==4)			
					*(txt+i)=';';
				else
					*(txt+i)=',';
				i++;
			}
		}
	}	
	//backlight
	*(txt+i)='5';
	i++;
	*(txt+i)='1';
	i++;
	*(txt+i)=',';
	i++;
	data[0]=BACKLIGHT;
	tmp[0]=data[0]/100;
	num=data[0]%100;
	tmp[1]=num/10;
	tmp[2]=num%10;
	if(tmp[0]!=0)
	{
		*(txt+i)=tmp[0]+48;
		i++;
		*(txt+i)=tmp[1]+48;
		i++;
		*(txt+i)=tmp[2]+48;
		i++;
	}
	else if(tmp[1]!=0)
	{
		*(txt+i)=tmp[1]+48;
		i++;
		*(txt+i)=tmp[2]+48;
		i++;
	}		
	else
	{
		*(txt+i)=tmp[2]+48;
		i++;
	}
	*(txt+i)=';';
	i++;
	
