welonhan/STM32F407_RC_EMWIN_EX_SDRAM/Projects/Src/main.c
	//model
	*(txt+i)='6';
	i++;
	*(txt+i)='1';
	i++;
	*(txt+i)=',';
	i++;
	data[0]=MODEL;
	tmp[0]=data[0]/100;
	num=data[0]%100;
	tmp[1]=num/10;
	tmp[2]=num%10;
	if(tmp[0]!=0)
	{
		*(txt+i)=tmp[0]+48;
		i++;
		*(txt+i)=tmp[1]+48;
		i++;
		*(txt+i)=tmp[2]+48;
		i++;
	}
	else if(tmp[1]!=0)
	{
		*(txt+i)=tmp[1]+48;
		i++;
		*(txt+i)=tmp[2]+48;
		i++;
	}		
	else
	{
		*(txt+i)=tmp[2]+48;
		i++;
	}
	*(txt+i)=';';
	i++;
	
	//ADC REF
	*(txt+i)='7';
	i++;
	*(txt+i)='1';
	i++;
	*(txt+i)=',';
	i++;
	data[0]=ADC_REF;
	tmp[0]=data[0]/100;
	num=data[0]%100;
	tmp[1]=num/10;
	tmp[2]=num%10;
	if(tmp[0]!=0)
	{
		*(txt+i)=tmp[0]+48;
		i++;
		*(txt+i)=tmp[1]+48;
		i++;
		*(txt+i)=tmp[2]+48;
		i++;
	}
	else if(tmp[1]!=0)
	{
		*(txt+i)=tmp[1]+48;
		i++;
		*(txt+i)=tmp[2]+48;
		i++;
	}		
	else
	{
		*(txt+i)=tmp[2]+48;
		i++;
	}
	*(txt+i)=';';
	i++;
	*(txt+i)='\0';
	
	return i;
}


/**
  * @brief  Read config data file from SD Card
  * @param  None
  * @retval None
  */
void TXT_2_NUM(uint8_t* txt)
{
	uint32_t i=0,j=0,ch=0,k=0,model=0;
	uint8_t tmp[3];
	uint32_t num;
	uint32_t data[5];	
	//Typdef_ModelData *_ModelData[4];
	for(i=0;*(txt+i)!='\0';i++)
  { 
		if((*(txt+i)!=';')&&(*(txt+i)!=','))
		{	
			tmp[j]=*(txt+i);
			j++;
		}
		else
		{
			if(j==1)
				num=tmp[0]-48;
			else if(j==2)
				num=10*(tmp[0]-48)+(tmp[1]-48);
			else if(j==3)
				num=100*(tmp[0]-48)+10*(tmp[1]-48)+(tmp[2]-48);
			
			j=0;
			data[k]=num;
			k++;
		}
		
		if(*(txt+i)==';')
		{
			k=0;
			model=data[0]/10-1;
			ch=data[0]%10-1;
			if((ch<4)&&(model<4))
			{
				_ModelData[model][ch].Model=data[0];
				_ModelData[model][ch].SubTrim=(signed int)(data[1]-50);				
				_ModelData[model][ch].Endpoint_p=data[2];
				_ModelData[model][ch].Endpoint_n=data[3];
				_ModelData[model][ch].Reverse=data[4];
				//ch++;				
			}
			//if(ch==4)
			////{
			//	ch=0;
				//model++;
			//}
			if(model==4)
			{
				//model++;
				BACKLIGHT=data[1];			
			}
			if(model==5)
				MODEL=data[1];
			if(model==6)
				ADC_REF=data[1];
		}			
	}
}



/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 168000000
  *            HCLK(Hz)                       = 168000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 8000000
  *            PLL_M                          = 8
  *            PLL_N                          = 336
  *            PLL_P                          = 2
  *            PLL_Q                          = 7
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 5
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;

  /* Enable Power Control clock */
  __HAL_RCC_PWR_CLK_ENABLE();
  
  /* The voltage scaling allows optimizing the power consumption when the device is 
     clocked below the maximum system frequency, to update the voltage scaling value 
     regarding system frequency refer to product datasheet.  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  
  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;  
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;  
  if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }

  /* STM32F405x/407x/415x/417x Revision Z devices: prefetch is supported  */
  if (HAL_GetREVID() == 0x1001)
  {
    /* Enable the Flash prefetch */
    __HAL_FLASH_PREFETCH_BUFFER_ENABLE();
  }
}

/**
  * @brief EXTI line detection callbacks
  * @param GPIO_Pin: Specifies the pins connected EXTI line
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	uint8_t NRF24L01_IRQ_status;
	//uint32_t=10000;
  if((GPIO_Pin == TOUCH_INT_PIN)&&BACKLIGHT_ON)										//PB7 TOUCH INT
  {

    if(BSP_TOUCH_Read(TOUCH_Dat)==0)
		{	/*
			BSP_LCD_DrawPixel(TOUCH_Dat.x, TOUCH_Dat.y, RED);
			BSP_LCD_DrawPixel(TOUCH_Dat.x, TOUCH_Dat.y+1, RED);
			BSP_LCD_DrawPixel(TOUCH_Dat.x+1, TOUCH_Dat.y, RED);
			BSP_LCD_DrawPixel(TOUCH_Dat.x+1, TOUCH_Dat.y, RED);
			*/
			Touch_State.Layer=0;
			Touch_State.x=TOUCH_Dat.x;
			Touch_State.y=TOUCH_Dat.y;
			Touch_State.Pressed=TOUCH_Dat.pressed;
			GUI_PID_StoreState(&Touch_State);
			
			BSP_LED_Toggle(LEDG);
		}
		else
			Touch_State.Pressed=TOUCH_Dat.pressed;
			GUI_PID_StoreState(&Touch_State);
			BSP_LED_Toggle(LEDR);
  }
	
	else if(GPIO_Pin == KEY_BUTTON_PIN)									//PA0 KEY INT
  {
    BSP_LED_Toggle(LEDR);
		//GUI_Delay(20);
		
		if(BACKLIGHT_ON)
		{
			//BSP_LCD_BACKLIGHT_PWM_Set(0);
			BACKLIGHT_ON=0;
			BSP_LCD_BACKLIGHT_Off();
		}
		else
		{
			BSP_LCD_BACKLIGHT_PWM_Set(BACKLIGHT);
			BACKLIGHT_ON=1;
			
		}
		
#ifdef DEBUG_MODE		
		NRF24L01_TxPacket( (uint8_t *)NRF24L01_TX_DATA, NRF24L01_TX_NUM );


		if (duty==0)
		{	LCD_BACKLIGHT_PWM_50duty();
			duty=1;
		}
			else 
		{
			LCD_BACKLIGHT_PWM_25duty();
			duty=0;
		}
#endif		
  }
	
