welonhan/STM32F407_RC_EMWIN_EX_SDRAM/Projects/Src/main.c
	else if(GPIO_Pin == RF24L01_IRQ_GPIO_PIN)						//RF24L01 IRQ
	{
#ifdef DEBUG_MODE
		NRF24L01_IRQ_status=NRF24L01_IRQ((uint8_t *) &NRF24L01_ACK_DATA,NRF24L01_ACK_NUM);
		if(NRF24L01_IRQ_status ==(TX_OK|RX_OK))
		{	
			for(i=0;i<8;i++)
			{
				if(NRF24L01_ACK[i]!=NRF24L01_ACK_DATA[i])
					return;
			}	
			BSP_LED_Toggle(LED4);			
		}
#else
		NRF24L01_IRQ_status=NRF24L01_IRQ((uint8_t *)&RC_DATA.RC_ACK_Data.RX_BAT_L,NRF24L01_ACK_NUM);	
		if(NRF24L01_IRQ_status ==(TX_OK|RX_OK))
		{	
			RC_DATA.RX_BAT=(uint16_t)RC_DATA.RC_ACK_Data.RX_BAT_H;
			RC_DATA.RX_BAT=(RC_DATA.RX_BAT <<8) + RC_DATA.RC_ACK_Data.RX_BAT_L;
			BSP_LED_Toggle(LEDG);			
		}
#endif		
	}
	
}

/**
  * @brief  处理转向油门ADC数据
  * @param  RC_DATA_TypeDef
  * @retval None
  */
void RC_TX_DataHandle(RC_DATA_TypeDef* rc_data,Typdef_ModelData *_ModelData)
{
	uint32_t tmp;
	uint32_t temp,temp_mid;
	
	//调整中心
	temp_mid=rc_data->ADC_StrMid	+(_ModelData[0].SubTrim*12);				
	/////////////////////////////////////////////////////////////////////////
	//转向采样小于回中值，向左转, 0-100
	if(temp_mid>rc_data->ADC_DATA.ADC_STR)
	{	
		tmp=(100*(temp_mid-rc_data->ADC_DATA.ADC_STR))/temp_mid;
		tmp=-(tmp*_ModelData[0].Endpoint_n/100);
	}
	//转向采样大于回中值，向右转 100-200
	else
	{
		tmp=(100*(rc_data->ADC_DATA.ADC_STR-temp_mid))/(0xFFF-temp_mid);
		tmp=tmp*_ModelData[0].Endpoint_p/100;					
	}
	
	//反向
	if(_ModelData[0].Reverse==1)
			tmp=-tmp;
	rc_data->RC_TX_Data.CHANNEL1=100+tmp;
	
	///////////////////////////////////////////////////////////////////////////
	//处理channel1 指示数据
	if(rc_data->RC_TX_Data.CHANNEL1<=100)
	{
		tmp=(45*rc_data->RC_TX_Data.CHANNEL1)/100;
		DASH_BOARD[0]=135+tmp;
	}
	else
	{
		tmp=(45*(rc_data->RC_TX_Data.CHANNEL1-100))/100;
		DASH_BOARD[0]=180+tmp;
	}
	
	///////////////////////////////////////////////////////////////////////////
	//油门采样小于回中值，向前，100-200
	temp_mid=rc_data->ADC_ThrtMid	+(_ModelData[1].SubTrim*12);	
	if(temp_mid>rc_data->ADC_DATA.ADC_THRT)
	{	
		tmp=(100*(temp_mid-rc_data->ADC_DATA.ADC_THRT))/temp_mid;
		tmp=-(tmp*_ModelData[1].Endpoint_n/100);
	}
	//转向采样大于回中值，向后，0-100
	else
	{
		tmp=(100*(rc_data->ADC_DATA.ADC_THRT-temp_mid))/(0xFFF-temp_mid);
		tmp=tmp*_ModelData[1].Endpoint_p/100;
	}
	
	if(_ModelData[1].Reverse==1)
			tmp=-tmp;	
	rc_data->RC_TX_Data.CHANNEL2=100+tmp;
	
	///////////////////////////////////////////////////////////////////////////
	//处理channel2 指示数据
	if(rc_data->RC_TX_Data.CHANNEL2<100)
	{
		tmp=(45*rc_data->RC_TX_Data.CHANNEL2)/100;
		DASH_BOARD[1]=135+tmp;
	}
	else
	{
		tmp=(45*(rc_data->RC_TX_Data.CHANNEL2-100))/100;
		DASH_BOARD[1]=180+tmp;
	}	
	
	///////////////////////////////////////////////////////////////////////////
	//处理channel3 指示数据
	tmp=100;
	if(_ModelData[2].Reverse==1)
	{
		if(CH3_Switch==1)
			tmp=tmp-_ModelData[2].Endpoint_n;
		else if(CH3_Switch==2) 
			tmp+=_ModelData[2].Endpoint_p;
		else if(CH3_Switch==0)
			tmp=tmp-_ModelData[2].SubTrim;
	}
	else
	{
		if(CH3_Switch==1)
			tmp+=_ModelData[2].Endpoint_p;
		else if(CH3_Switch==2) 
			tmp=tmp-_ModelData[2].Endpoint_n;
		else if(CH3_Switch==0)
			tmp+=_ModelData[2].SubTrim;
	}
	rc_data->RC_TX_Data.CHANNEL3=tmp;

	if(rc_data->RC_TX_Data.CHANNEL3<=100)
	{
		tmp=(45*rc_data->RC_TX_Data.CHANNEL3)/100;
		DASH_BOARD[2]=135+tmp;
	}
	else
	{
		tmp=(45*(rc_data->RC_TX_Data.CHANNEL3-100))/100;
		DASH_BOARD[2]=180+tmp;
	}
	
	///////////////////////////////////////////////////////////////////////////
	//处理channel4 指示数据
	tmp=100;
	if(_ModelData[3].Reverse==1)
	{
		if(CH4_Switch==1)
			tmp=tmp-_ModelData[3].Endpoint_n;
		else if(CH4_Switch==2) 
			tmp+=_ModelData[3].Endpoint_p;
		else
			tmp=tmp-_ModelData[3].SubTrim;
	}
	else
	{
		if(CH4_Switch==1)
			tmp+=_ModelData[3].Endpoint_p;
		else if(CH4_Switch==2) 
			tmp=tmp-_ModelData[3].Endpoint_n;	
		else
			tmp+=_ModelData[3].SubTrim;
	}
	rc_data->RC_TX_Data.CHANNEL4=tmp;

	if(rc_data->RC_TX_Data.CHANNEL4<=100)
	{
		tmp=(45*rc_data->RC_TX_Data.CHANNEL4)/100;
		DASH_BOARD[3]=135+tmp;
	}
	else
	{
		tmp=(45*(rc_data->RC_TX_Data.CHANNEL4-100))/100;
		DASH_BOARD[3]=180+tmp;
	}
	
	//温度处理, 单位摄氏度
	//(Vsense-V25)/Vslope+25, Vref=2890mV, Vsense=Vref*Adc>>12, V25=760mV, Vslope=2.5mV/C     
	temp=(10*(((rc_data->ADC_DATA.ADC_TMP*(3260+ADC_REF-50))>>12)-760))/25+25;
	ADC_Tmp_Num +=temp;

	
	
	//电池电压处理，单位mV
	//Vsense=Vref*Adc>>12, Vref=3250mV  
	temp=(((rc_data->ADC_DATA.ADC_BAT*(3260+ADC_REF-50))>>12)/2)*3;
	ADC_Bat_Num+=temp;
	
	ADC_Count++;
	if(ADC_Count==10)
	{
		rc_data->TX_BAT=(ADC_Bat_Num/ADC_Count);
		rc_data->TX_TMP=(ADC_Tmp_Num/ADC_Count);
		ADC_Count=0;
		ADC_Bat_Num=0;
		ADC_Tmp_Num=0;
	}
}

void SRAM_Test()
{
	//uint8_t uwWriteReadStatus;
	uint32_t uwIndex;
	/*##-2- SRAM memory read/write access ######################################*/  
  /* Fill the buffer to write */
	Fill_Buffer(aTxBuffer, BUFFER_SIZE, 0xC20F);   
  /*
	for (uwIndex = 0; uwIndex < BUFFER_SIZE; uwIndex++)
  {
    if(uwIndex%2==1)
			aTxBuffer[uwIndex]=0xFFFF;
		else
			aTxBuffer[uwIndex]=0;
  }
	*/
  /* Write data to the SRAM memory */
  for (uwIndex = 0; uwIndex < BUFFER_SIZE; uwIndex++)
  {
    *(__IO uint16_t*) (SRAM_BANK_ADDR + WRITE_READ_ADDR + 2*uwIndex) = aTxBuffer[uwIndex];
  }    
  
  /* Read back data from the SRAM memory */
  for (uwIndex = 0; uwIndex < BUFFER_SIZE; uwIndex++)
  {
    aRxBuffer[uwIndex] = *(__IO uint16_t*) (SRAM_BANK_ADDR + WRITE_READ_ADDR + 2*uwIndex);
  } 

  /*##-3- Checking data integrity ############################################*/    
  //uwWriteReadStatus = Buffercmp(aTxBuffer, aRxBuffer, BUFFER_SIZE);	
	
	
}


/**
  * @brief  Fills buffer with user predefined data.
  * @param  pBuffer: pointer on the buffer to fill
  * @param  uwBufferLenght: size of the buffer to fill
  * @param  uwOffset: first value to fill on the buffer
  * @retval None
  */
static void Fill_Buffer(uint16_t *pBuffer, uint32_t uwBufferLenght, uint16_t uwOffset)
{
  uint16_t tmpIndex = 0;

  /* Put in global buffer different values */
  for (tmpIndex = 0; tmpIndex < uwBufferLenght; tmpIndex++ )
  {
    pBuffer[tmpIndex] = tmpIndex + uwOffset;
  }
} 

/**
  * @brief  Compares two buffers.
  * @param  pBuffer1, pBuffer2: buffers to be compared.
  * @param  BufferLength: buffer's length
  * @retval PASSED: pBuffer identical to pBuffer1
  *         FAILED: pBuffer differs from pBuffer1
  */
uint8_t Buffercmp(uint16_t* pBuffer1, uint16_t* pBuffer2, uint16_t BufferLength)
{
  while (BufferLength--)
  {
    if (*pBuffer1 != *pBuffer2)
    {
      return 0;
    }

    pBuffer1++;
    pBuffer2++;
  }

  return 1;
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
static void Error_Handler(void)
{
  /* Turn LED3 on */
  BSP_LED_On(LEDR);
  while(1)
  {
  }
}

#ifdef  USE_FULL_ASSERT


/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

int fputc(int ch, FILE *f)
{
	USART2->DR = ((uint8_t)ch & (uint16_t)0x01FF);
	while (!(USART2->SR & USART_SR_TXE));
	return (ch);
}



/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
